/** @type {import('tailwindcss').Config} */
export default {
  content: [
    "./index.html",
    "./src/**/*.{vue,js,ts,jsx,tsx}",
  ],
  darkMode: 'class',
  theme: {
    extend: {
      colors: {
        slate: {
          // Оставляем светлую тему без изменений
          50: '#f8fafc',
          100: '#f1f5f9',
          200: '#e2e8f0',
          300: '#cbd5e1',
          400: '#94a3b8',
          500: '#64748b',
          600: '#475569',
          // Переопределяем темную тему под фирменные цвета Gemini
          700: '#333538', // Цвет границ и паттерна точек
          800: '#1e1f20', // Цвет карточек (Nodes), Хедера и Сайдбара
          900: '#131314', // Главный фон холста и дашборда
        }
      }
    },
  },
  plugins: [],
}